nc: 80  # number of classes

scales:
  l: [1.00, 0.91, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 1, HGRABlock, [128]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 1, HGRABlock, [256]]        # 4 (for P3 projection)
  - [-1, 1, Conv, [384, 3, 2]]       # 5-P4/16
  - [-1, 1, HGRABlock, [384]]        # 6 (for P4 projection)
  - [-1, 1, Conv, [384, 3, 2]]       # 7-P5/32
  - [-1, 3, HGRABlock, [384]]        # 8 (for P5 projection)

# Head
head:
  # Input Projection (P5 -> 256)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]    # 9 input_proj.2

  # CASABlock replaces AIFI
  - [-1, 1, CASABlock, [256, 8]]                     # 10
  - [-1, 1, Conv, [256, 1, 1]]                       # 11 Y5 lateral

  # Top-Down: P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]     # 13 P4 projection
  - [[-2, -1], 1, Concat, [1]]                       # 14
  - [-1, 3, RepC3, [256, 0.5]]                       # 15
  - [-1, 1, Conv, [256, 1, 1]]                       # 16 Y4 lateral

  # Top-Down: P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       # 17
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]     # 18 P3 projection
  - [[-2, -1], 1, Concat , [1]]                       # 19
  - [-1, 1, DSFPNModule,[512, 256]]                 # 20  replace original RepC3

  # Bottom-Up: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                       # 21
  - [[-1, 16], 1, Concat, [1]]                       # 22
  - [-1, 1, DSFPNModule, [512, 256]]                 # 23  replace original RepC3

  # Bottom-Up: P4 -> P5
  - [-1, 1, Conv, [256, 3, 2]]                       # 24
  - [[-1, 11], 1, Concat, [1]]                       # 25
  - [-1, 3, RepC3, [256, 0.5]]                       # 26

  # Decoder
  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 27